[
	{
		"title": "Passion, Metaverse, Self-Doubt \u0026 SaveSoil | Nico Rosberg \u0026 Sadhguru",
		"url": "https://isha.sadhguru.org/us/en/wisdom/video/passion-metaverse-self-doubt-savesoil-nico-rosberg-sadhguru",
		"cover_image": "",
		"body": "Former Formula One World Champion, Nico Rosberg, discusses metaverse, self-doubt, passion, technologies and the #SaveSoil movement with Sadhguru.",
		"last_updated": "2022-11-02T15:32:36.421251+05:30"
	},
	{
		"title": "Eclipse and Food – Life Sense, not Internet Science | Sadhguru",
		"url": "https://isha.sadhguru.org/us/en/wisdom/audio/eclipse-and-food-life-sense-not-internet-science",
		"cover_image": "",
		"body": "Is it true that you should not eat during an eclipse? While such food won’t kill you, says Sadhguru, it will lower your perception. For a yogi, the loss of sensitivity is as good as death, he explains. Like a high-performance vehicle, if you want to function at your highest, you must look carefully at what kind of fuel goes into you.",
		"last_updated": "2022-11-02T15:32:36.421295+05:30"
	},
	{
		"title": "Bahrain’s Oldest Souq Hosts Sadhguru",
		"url": "https://isha.sadhguru.org/us/en/wisdom/video/bahrains-oldest-souq-hosts-sadhguru",
		"cover_image": "",
		"body": "During the Middle Eastern leg of the #SaveSoil movement, Bahrain’s oldest souq in Manama hosted Sadhguru.",
		"last_updated": "2022-11-02T15:32:36.421332+05:30"
	},
	{
		"title": "KGF Actress Srinidhi Shetty Asks Sadhguru About His Love for Mysuru",
		"url": "https://isha.sadhguru.org/us/en/wisdom/audio/kgf-actress-srinidhi-shetty-asks-sadhguru",
		"cover_image": "",
		"body": "Lead actress of the popular Kannada films KGF \u0026amp; KGF2, Srinidhi Shetty, catches up with Sadhguru in his hometown Mysuru during the #SaveSoil journey, and discusses Sadhguru’s love for the city, and the #SaveSoil movement.",
		"last_updated": "2022-11-02T15:32:36.421368+05:30"
	},
	{
		"title": "Learn How To Improve Your Brain’s Memory \u0026 Recall | Sadhguru Exclusive",
		"url": "https://isha.sadhguru.org/us/en/wisdom/video/improve-your-brains-memory-recall",
		"cover_image": "",
		"body": "Considered among India’s 50 most influential people, Sadhguru is a yogi, mystic, bestselling author, and poet. Absolute clarity of perception places him in a unique space, not only in matters spiritual but in business, environmental and international affairs, and opens a new door on all that he touches.",
		"last_updated": "2022-11-02T15:32:36.421403+05:30"
	},
	{
		"title": "How Not to Fall Asleep During Meditation | Sadhguru",
		"url": "https://isha.sadhguru.org/us/en/wisdom/audio/how-not-to-fall-asleep-during-meditation-sadhguru",
		"cover_image": "",
		"body": "Sadhguru gives a simple and effective tip – eating 24 morsels of food and chewing each morsel 24 times – to stay alert throughout the day, create the right condition in the body to become meditative and to keep the doctor away for life.",
		"last_updated": "2022-11-02T15:32:36.421442+05:30"
	}
]